In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score, mean_squared_error, mean_absolute_error
import random

In [11]:
df = pd.read_csv('dataset/Spotify_artist_Data.csv')

In [12]:
df.describe()

        Unnamed: 0         index           age
count  10000.00000  10000.000000  10000.000000
mean    4999.50000   1917.590800     18.767500
std     2886.89568   1320.064221     20.583693
min        0.00000      0.000000      0.000000
25%     2499.75000    833.000000      0.000000
50%     4999.50000   1666.000000     14.000000
75%     7499.25000   2830.250000     33.000000
max     9999.00000   4995.000000    149.000000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  10000 non-null  int64
 1   index       10000 non-null  int64
 2   artist      10000 non-null  object
 3   gender      8248 non-null   object
 4   age         10000 non-null  int64
 5   type        8248 non-null   object
 6   country     6646 non-null   object
 7   city_1      693 non-null    object
 8   district_1  12 non-null     object
 9   city_2      3274 non-null   object
 10  district_2  188 non-null    object
 11  city_3      207 non-null    object
 12  district_3  17 non-null     object
dtypes: int64(3), object(10)
memory usage: 1015.8+ KB

In [14]:
df.isnull().sum()

Unnamed: 0       0
index            0
artist           0
gender        1752
age              0
type          1752
country       3354
city_1        9307
district_1    9988
city_2        6726
district_2    9812
city_3        9793
district_3    9983
dtype: int64

In [17]:
df = df.dropna(axis=1)

In [18]:
df.isna().sum()

Unnamed: 0    0
index         0
artist        0
age           0
dtype: int64

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  10000 non-null  int64
 1   index       10000 non-null  int64
 2   artist      10000 non-null  object
 3   age         10000 non-null  int64
dtypes: int64(3), object(1)
memory usage: 312.6+ KB

In [20]:
df.head()

   Unnamed: 0  index       artist  age
0           0      0        Drake   33
1           1      1  Post Malone   25
2           2      2   Ed Sheeran   29
3           3      3     J Balvin   35
4           4      4    Bad Bunny   26

In [21]:
df = df.iloc[:, 1:]

In [22]:
df.head()

   index       artist  age
0      0        Drake   33
1      1  Post Malone   25
2      2   Ed Sheeran   29
3      3     J Balvin   35
4      4    Bad Bunny   26